In [1]:
import pandas as pd

In [2]:
test_dict = {'Pedro': [18, 20, 22], 'Michele': [25, 35, 45], 'Marta': [2, 3, 4]}

In [3]:
df = pd.DataFrame(test_dict)

In [5]:
df[0:2]

   Pedro  Michele  Marta
0     18       25      2
1     20       35      3

In [6]:
df[1:2]

   Pedro  Michele  Marta
1     20       35      3

In [7]:
df.T

          0   1   2
Pedro    18  20  22
Michele  25  35  45
Marta     2   3   4

In [8]:
df

   Pedro  Michele  Marta
0     18       25      2
1     20       35      3
2     22       45      4

In [9]:
dft = df.T

In [10]:
dft

          0   1   2
Pedro    18  20  22
Michele  25  35  45
Marta     2   3   4

In [11]:
dft.columns = ['Primero', 'Segundo', 'Tercero']

In [12]:
dft

         Primero  Segundo  Tercero
Pedro         18       20       22
Michele       25       35       45
Marta          2        3        4

In [13]:
rows = ['Pedro', 'Michele']
cols = ['Segundo','Tercero']

In [16]:
df_spring = dft.loc[rows, cols]
df_spring

         Segundo  Tercero
Pedro         20       22
Michele       35       45

In [18]:
dft.iloc[[1,2],[0,1]]

         Primero  Segundo
Michele       25       35
Marta          2        3

In [23]:
dft.iloc[0:2, 1:3]

         Segundo  Tercero
Pedro         20       22
Michele       35       45

In [29]:
dft['Nuevo_Promedio'] = dft.mean(axis=1)

In [27]:
dft

         Primero  Segundo  Tercero  Nuevo_Promedio
Pedro         18       20       22             NaN
Michele       25       35       45             NaN
Marta          2        3        4             NaN

In [30]:
dft['Otros']=[99,99,99]

In [31]:
dft

         Primero  Segundo  Tercero  Nuevo_Promedio  Otros
Pedro         18       20       22            20.0     99
Michele       25       35       45            35.0     99
Marta          2        3        4             3.0     99

In [32]:
del dft['Nuevo_Promedio']

In [33]:
dft

         Primero  Segundo  Tercero  Otros
Pedro         18       20       22     99
Michele       25       35       45     99
Marta          2        3        4     99